-Nesting: How did you organize the additional details in the traveler
field, and how does it improve the organization of the data overall?

name is its own key-value pair.  contact is an object with email and phone inside the object.

Having them inside an object groups similar entities together.  It makes it easy to add additional attributes in the future if needed.

- Arrays: For the destinations and activities, what data structure
did you use? What impact did this decision have?

The data structure we used is an array of objects.  It allows us to have any number of destinations and activities.  

- Scalability: How could this JSON structure be expanded to include
additional details, such as hotel information or transportation options?

Hotel information could be added to the objects within the destinations array.  Depending on the need, transporation options could be added to either the objects within the destinations array or the objects within the activities array.

- Real-World Application: How would this data be useful in a travel app
or API?

This data would be useful in a travel app or API because the traveler could see what activities they had planned for each day when they were actually on the trip.  In addition, it would be useful for the travel agency so that they could see their clients trip details if they were contacted for support.  

-Add a transportation field to each destination, containing nested
objects for mode (string, e.g., "Flight") and cost (number, e.g., 150.00).
  Discuss how their additions enhance the data model.

It would allow the traveler to budget the cost of the trip and know where to go (e.g. airport of train station) when looking to complete the next leg of their trip.


-Add a transportion field:

{
    "tripName": "Europe 2026",
    "traveler": 
    {
        "name": "Georgia O'Keeffe",
        "contact": 
        {
            "email": "georgia@example.com",
            "phone": "123-456-7890"
        }
    },
    "destinations":
    [
        {
            "location": "Paris",
            "arrivalDate": "2026-06-01",
            "departureDate": "2026-06-02",
            "transportation":
            {
                "mode": "flight",
                "cost": 150.00
            },
            "activities":
            [
                {
                    "title": "Eiffel Tower Visit",
                    "time": "10:00 AM"
                },
                {
                    "title": "Louvre Museum Tour",
                    "time": "1:00 PM"
                }
            ]
        },
        {
            "location": "London",
            "arrivalDate": "2026-06-02",
            "departureDate": "2026-06-03",
            "transportation":
            {
                "mode": "train",
                "cost": 350.00
            },
            "activities":
            [
                {
                    "title": "Tea at Buckingham Palace",
                    "time": "9:00 AM"
                },
                {
                    "title": "Tate Modern Tour",
                    "time": "12:00 PM"
                }
            ]
        },
        {
            "location": "Rome",
            "arrivalDate": "2026-06-03",
            "departureDate": "2026-06-04",
            "transportation":
            {
                "mode": "flight",
                "cost": 1000.00
            },
            "activities":
            [
                {
                    "title": "Coloseum Tour",
                    "time": "9:30 AM"
                },
                {
                    "title": "Pisa Tour",
                    "time": "1:30 PM"
                }
            ]
        }
    ]
}